# ServiceId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..ServiceId Property
FabricationServiceButton Class See Also
---
The fabrication service identifier for the fabrication service this button belongs to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ServiceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceId As Integer
	Get
```

Visual C++
---
```text
public:
property int ServiceId {
	int get ();
}
```

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace